# Specify the DASH_API_KEY here if you want to enable prompt extension, and add --use_prompt_extend to the following example
export DASH_API_KEY="sk-xxxxxxxxxxxxxxxxxxx"

torchrun generate.py \
    --prompt '[1]这个片段展示了一个白种人，男性，老年。该人物发型为短发，发色为灰白色，头发蓬松，略微向后梳。该人物服饰为身穿一件浅绿色衬衫，外面套着一件深灰色马甲。马甲上有口袋和拉链细节。该人物表情为平静，略带微笑，眼神专注，似乎在倾听或思考。该人物动作为静止站立，身体略微前倾，头部轻微转动，似乎在与人交谈。视频场景为：背景是一个金属结构的墙面，墙面上有许多圆形灯光，灯光呈模糊状态。墙面结构具有重复的线条和几何形状。整体场景显得简洁而现代。视频打光为整体光线柔和，主要光源来自前方，照亮了该人物的面部和上半身。[2]这个片段展示了一个白种人，男性，老年。该人物发型为短发，发色为灰白色，头发蓬松，略微向后梳。该人物服饰为身穿一件浅绿色衬衫，外面套着一件深灰色马甲。马甲上有口袋和拉链细节。该人物表情为平静，略带微笑，眼神专注，似乎在倾听或思考。该人物动作为坐在咖啡馆的靠窗位置，手里端着一杯咖啡，轻轻地品尝着。视频场景为一个充满情调的咖啡馆，空气中弥漫着咖啡的香气，柔和的灯光照亮着桌椅，墙上挂着艺术画作，营造出一种温馨浪漫的氛围。视频打光为室内灯光与室外光线相结合，整体光线柔和，突出了咖啡和人物的惬意。[3]这个片段展示了一个白种人，男性，老年。该人物发型为短发，发色为灰白色，头发蓬松，略微向后梳。该人物服饰为身穿一件浅绿色衬衫，外面套着一件深灰色马甲。马甲上有口袋和拉链细节。该人物表情为平静，略带微笑，眼神专注，似乎在倾听或思考。该人物动作为在海边缓缓散步，时不时停下脚步，眺望远方。视频场景为开阔的海滩，海浪轻轻拍打着沙滩，海风吹拂着他的头发和衣角，远处海天一色，偶尔有海鸥飞过，显得宁静而广阔。视频打光为自然光，阳光洒在海面和人物身上，营造出一种温暖而自由的氛围。' \
    --shot_len '10,6,8' \
    --sample_frames 125 \
    --echoshot_model 'models/EchoShot/EchoShot-1.3B-preview.pth' \
    --wan_model 'models/Wan2.1-T2V-1.3B' \
    --base_seed 2025 \
    --out_dir 'outputs'
    # --use_prompt_extend